app/Http/Controllers/Auth/LoginController.php

    function authenticated(Request $request, $user)
    {
        LoginRetention::create([
            'user_id'       => $user->id,
            'login_ip'      => $request->ip(),
            'login_time'    => Carbon::now(),
            'user_agent'    => $request->userAgent(),
        ]);
---
insert into `login_retentions` (`user_id`, `login_ip`, `login_time`, `user_agent`, `updated_at`, `created_at`) values (1, '127.0.0.1', '2022-10-25 13:32:17', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/106.0.0.0 Safari/537.36', '2022-10-25 13:32:17', '2022-10-25 13:32:17')