app/Http/Controllers/DepartmentController.php

  public function index()
  {
    $dep = Department::with('director')->withTrashed()->orderBy('name', 'asc')->get();
---
select * from `departments` where `departments`.`deleted_at` is null order by `name` asc

  public function store(Request $request)
  {
    $rules = [
      'name'                => 'required|string',
      'abbreviation'        => 'required|string|min:2',
      'number_employees'    => 'required|numeric|gt:0',
    ];
    $validated = $request->validate($rules);
    // in DepartmentController.php method store()

    try {
      $d = Department::create([
        'name'                => $request['name'],
        'abbreviation'        => $request['abbreviation'],
        'number_employees'    => $request['number_employees'],
      ]);
---
insert into `departments` (`name`, `abbreviation`, `number_employees`, `director_id`, `updated_at`, `created_at`) values ('2test', 'TT', '10', 1, '2022-11-09 09:34:36', '2022-11-09 09:34:36')

  public function edit($id)
  {
    //
    return view('departments.edit')->with('department', Department::find($id));
---
select * from `departments` where `departments`.`id` = '8' and `departments`.`deleted_at` is null limit 1

  public function update(Request $request, $id)
  {
    $rules = [
      'name'                => 'required|string',
      'abbreviation'        => 'required|string|min:2',
      'number_employees'    => 'required|numeric|gt:0',
    ];
    $validated = $request->validate($rules);

    $d = Department::find($id);
---
select * from `departments` where `departments`.`id` = '8' and `departments`.`deleted_at` is null limit 1

  public function destroy($id)
  {
    try {
      Department::find($id)->delete();
---
delete from `departments`
select * from `departments` where `departments`.`id` = '47' and `departments`.`deleted_at` is null limit 1
update `departments` set `deleted_at` = '2022-10-24 18:47:21', `departments`.`updated_at` = '2022-10-24 18:47:21' where `id` = 47

  public function forceDestroy($id){
    try {
      $d = Department::withTrashed()->find($id)->forceDelete();
---
delete from `departments` where `id` = 42
select * from `departments` where `departments`.`id` = '42' limit 1

  public function restore($id){
    try {
      $d = Department::withTrashed()->find($id)->restore();
---
select * from `departments` where `departments`.`id` = '29' limit 1
update `departments` set `deleted_at` = '', `departments`.`updated_at` = '2022-10-24 19:21:50' where `id` = 29