app/Http/Controllers/UserController.php

  public function index()
  {
    $users = User::with('departments', 'positions')->limit(2)->get();
---
select * from `users`

  public function index2()
  {
    $users = User::join('departments', 'users.id', '=', 'departments.director_id')->limit(4)->get();
---
select * from `departments` where `departments`.`director_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11) and `departments`.`deleted_at` is null